app/views/orders/form_steps/_table_step.html.erb

SELECT "tables".* FROM "tables"
---
        <%= form.label :table_id %>
        <%= form.select :table_id, Table.all.map{|table| ["#{table.name}","#{table.id}"]}, {}, {class: "custom-select", name: 'order[table][][id]'} %>