app/services/create_order_and_order_details.rb

  def perform
    ActiveRecord::Base.transaction do
      order = Order.create!(name: params[:order][:name], table_id: params[:table_id])
      total_price = 0
      params[:dishes].each do |dish|
        d = Dish.find dish[:dish_id]
        total_price += price*quantity
        order.order_details.create!(dish_id: dish.id, quantity: dish[:quantity], price: d.money, cost: price*quantity)
      end
      order.update total_price: total_price
---
INSERT INTO "orders" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "11"], ["user_id", 2], ["created_at", "2020-10-07 12:18:38.993600"], ["updated_at", "2020-10-07 12:18:38.993600"]]
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "order_details" ("order_id", "dish_id", "quantity", "price", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["order_id", 2], ["dish_id", 2], ["quantity", 4], ["price", 10000], ["cost", 40000], ["created_at", "2020-10-07 12:26:34.810127"], ["updated_at", "2020-10-07 12:26:34.810127"]]
UPDATE "orders" SET "updated_at" = ?, "total_price" = ? WHERE "orders"."id" = ?  [["updated_at", "2020-10-07 12:26:34.821773"], ["total_price", 104536], ["id", 2]]