app/views/dishes/show.html.erb

                            <div class="media-body">
                                  <% @dish.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."dish_id" = ?  [["dish_id", 1]]