app/controllers/application_controller.rb

  def category
    @categories = Category.all
    @category = Category.find_by params[:category_id]
---
SELECT  "categories".* FROM "categories" WHERE (1) LIMIT ?  [["LIMIT", 1]]