app/controllers/comments_controller.rb

SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("contents", "user_id", "dish_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["contents", "a"], ["user_id", 1], ["dish_id", 1], ["created_at", "2020-10-07 13:45:03.520018"], ["updated_at", "2020-10-07 13:45:03.520018"]]
---
  def create
    if signed_in?
      @user = current_user
      @comment = current_user.comments.build comment_params
      @dish = Dish.find params[:comment][:dish_id]
      if @comment.save