app/controllers/dishes_controller.rb

  def index
    @category = Category.find(params[:category_id])
    @dishes = @category.dishes.page params[:page]
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" LIMIT ?  [["LIMIT", 11]]
SELECT "dishes".* FROM "dishes" WHERE "dishes"."category_id" = ?  [["category_id", 1]]

  def show
    @dish = Dish.find params[:id]
    @comments = @dish.comments.page(params[:page]).per(5)
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."dish_id" = ? LIMIT ? OFFSET ?  [["dish_id", 1], ["LIMIT", 5], ["OFFSET", 0]]