app/controllers/orders_controller.rb

  def new
    @user = current_user
    @order = Order.new
    @tables = Table.all
    @dishes = Dish.all
---
SELECT "tables".* FROM "tables"
SELECT "dishes".* FROM "dishes"