app/controllers/pages_controller.rb

SELECT  "categories".* FROM "categories" LIMIT ?  [["LIMIT", 1]]
SELECT "dishes".* FROM "dishes"
---
  def home
    @categories = Category.all
    @dishes = Dish.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def order
  	@order = Order.find(params[:id])
  	@user = User.find(params[:user_id])