app/controllers/tables_controller.rb

SELECT  "tables".* FROM "tables" LIMIT ?  [["LIMIT", 11]]
---
    def index
        @tables = Table.paginate(page: params[:page],per_page: 10)